[
  {
    "id": 1,
    "slug": "hungvuong",
    "text": "- Vua Hùng là các vị vua đầu tiên của Việt Nam, lập ra nước Văn Lang.\n- Theo truyền thuyết, vị vua Hùng đầu tiên là người con cả của Lạc Long Quân và Âu Cơ, và chọn vùng Phong Châu (nay thuộc Phú Thọ) làm kinh đô, đặt tên nước là Văn Lang. \n- Triều đại các vua Hùng đã mở đầu cho nền văn minh lúa nước, tạo ra trống đồng Đông Sơn, ngoài ra còn nhiều phong tục tập quán đặc sắc\n- Ngày mùng 10 tháng 3 âm lịch hằng năm được xem là Quốc giỗ của dân tộc. Ngày mà con cháu đời sau dùng để tưởng nhớ công ơn dựng nước của các vua Hùng"
  },
  {
    "id": 2,
    "slug": "thucphan",
    "text": "- Xuất thân: Là thủ lĩnh của bộ tộc Âu Việt ở phía Bắc nước Văn Lang.\n- Công lao: Thục Phán đã lãnh đạo liên minh Âu Việt - Lạc Việt kháng chiến chống quân Tần xâm lược thành công.\n- Sự nghiệp: Khoảng đầu thế kỷ III TCN, ông thống nhất hai bộ tộc, lập ra nước Âu Lạc và xưng là An Dương Vương, dời đô về Cổ Loa.\n"
  },
  {
    "id": 3,
    "slug": "aulac",
    "text": "- Thành lập: Thục Phán đã thống nhất Âu Việt và Lạc Việt lại cùng nhau và đặt tên nước là Âu Lạc\n- Phát triển: Là một bước tiến so với nhà nước Văn Lang, với tổ chức nhà nước và quân đội chặt chẽ hơn.\n- Kinh đô: Dời từ Phong Châu (trung du) về Cổ Loa (đồng bằng), cho thấy một tư duy chiến lược mới, hướng tới phát triển toàn diện và phòng thủ chủ động.\n- Kết thúc: Sụp đổ vào năm 179 TCN sau cuộc xâm lược bằng mưu kế của Triệu Đà, mở đầu thời kỳ Bắc thuộc.\n"
  },
  {
    "id": 4,
    "slug": "thanhcoloa",
    "text": "- Vị trí: Kinh đô của nước Âu Lạc, nay thuộc huyện Đông Anh, Hà Nội.\n- Kiến trúc: Là một công trình quân sự độc đáo với ba vòng thành đất hình xoáy trôn ốc, kết hợp với hệ thống hào nước tự nhiên, tạo thành một pháo đài phòng thủ kiên cố.\n- Ý nghĩa: Là trung tâm chính trị, kinh tế, văn hóa sầm uất, đồng thời là minh chứng cho trình độ kỹ thuật và sự phân hóa xã hội thời Âu Lạc.\n"
  },
  {
    "id": 5,
    "slug": "giotohungvuong",
    "text": "- Thời gian: Được tổ chức vào ngày mùng 10 tháng 3 Âm lịch hằng năm tại Đền Hùng, Phú Thọ.\n- Ý nghĩa: Là ngày Quốc giỗ để con cháu tưởng nhớ công ơn dựng nước của các Vua Hùng, thể hiện đạo lý \"Uống nước nhớ nguồn\" và tinh thần đại đoàn kết dân tộc.\n- Vinh danh: Năm 2012, \"Tín ngưỡng thờ cúng Hùng Vương\" được UNESCO công nhận là Di sản văn hóa phi vật thể đại diện của nhân loại.\n"
  },
  {
    "id": 6,
    "slug": "nolienchau",
    "text": "- Huyền thoại: Là vũ khí huyền thoại của An Dương Vương, có khả năng bắn một lúc nhiều mũi tên, giúp đánh bại các cuộc tấn công của ngoại bang.\n- Sự thật lịch sử: Nỏ Liên Châu là một phát minh của vị tướng Cao Lỗ. Nỏ được chứng thực qua việc phát hiện hàng vạn mũi tên đồng ba cạnh tại Cổ Loa, cho thấy kỹ thuật quân sự và sản xuất vũ khí phát triển vượt bậc của nước Âu Lạc.\n"
  },
  {
    "id": 7,
    "slug": "trungnhi",
    "text": "- Xuất thân: Là con gái của Lạc tướng huyện Mê Linh (nay thuộc Hà Nội), thuộc dòng dõi quý tộc Hùng Vương. Trưng Trắc là chị, Trưng Nhị là em.\n\n- Khởi nghĩa (Năm 40-43): Phất cờ khởi nghĩa tại Hát Môn (Phúc Thọ, Hà Nội) để đáp lại chính sách cai trị tàn bạo của nhà Đông Hán, đứng đầu là Thái thú Tô Định, và để trả thù cho chồng của Trưng Trắc là Thi Sách bị giết hại.\n\n- Kết quả: Cuộc khởi nghĩa nhanh chóng được hưởng ứng, lật đổ chính quyền đô hộ, giải phóng 65 thành trì. Trưng Trắc tự xưng là vua (Trưng Nữ Vương), đóng đô ở Mê Linh, lập lại nền độc lập dân tộc.\n\n- Kết cục: Năm 42, nhà Hán cử danh tướng Mã Viện đem quân sang đàn áp. Sau nhiều trận chiến không cân sức, Hai Bà đã tuẫn tiết tại sông Hát để bảo toàn khí tiết.\n\n- Ý nghĩa: Là cuộc khởi nghĩa lớn đầu tiên, thể hiện ý chí độc lập, bất khuất của dân tộc. Mở đầu cho truyền thống chống ngoại xâm của phụ nữ Việt Nam."
  },
  {
    "id": 8,
    "slug": "melinh",
    "text": "Vị trí: Là một huyện ngoại thành của Hà Nội ngày nay.\n Lịch sử: Từng là quê hương của Hai Bà Trưng và được Trưng Nữ Vương chọn làm kinh đô sau khi đánh đuổi quân Đông Hán.\n Ý nghĩa: Là một vùng đất địa linh nhân kiệt, gắn liền với trang sử vàng của cuộc khởi nghĩa Hai Bà Trưng và sự nghiệp của nữ anh hùng dân tộc."
  },
  {
    "id": 9,
    "slug": "khoinghiahaibatrung",
    "text": "- Diễn biến: Hai Bà Trưng phất cờ khởi nghĩa tại Hát Môn (Phúc Thọ, Hà Nội) để đáp lại chính sách cai trị tàn bạo của nhà Đông Hán, đứng đầu là Thái thú Tô Định, và để trả thù cho chồng của Trưng Trắc là Thi Sách bị giết hại.\n\n- Kết quả: Cuộc khởi nghĩa nhanh chóng được hưởng ứng, lật đổ chính quyền đô hộ, giải phóng 65 thành trì. Trưng Trắc tự xưng là vua (Trưng Nữ Vương), đóng đô ở Mê Linh, lập lại nền độc lập dân tộc.\n\n- Kết cục: Năm 42, nhà Hán cử danh tướng Mã Viện đem quân sang đàn áp. Sau nhiều trận chiến không cân sức, Hai Bà đã tuẫn tiết tại sông Hát để bảo toàn khí tiết."
  },
  {
    "id": 10,
    "slug": "khoinghiaphunghung",
    "text": "- Diễn biến: cuối thế kỷ VIII Phùng Hưng lãnh đạo cuộc khởi nghĩa chống lại ách đô hộ của nhà Đường, bao vây và chiếm được phủ thành Tống Bình (Hà Nội).\n\n- Kết quả: Ông giành được quyền tự chủ trong một thời gian. Sau khi ông mất, nhân dân tôn ông là Bố Cái Đại Vương (nghĩa là \"Vua cha mẹ\"). Con trai ông là Phùng An nối nghiệp nhưng sau đó đã đầu hàng quân Đường.\n\n- Ý nghĩa: Tiếp nối truyền thống đấu tranh giành độc lập, thể hiện sự ủng hộ của nhân dân đối với các thủ lĩnh yêu nước."
  },
  {
    "id": 11,
    "slug": "nuocvanxuan",
    "text": "- Lịch sử: Tên gọi của quốc gia độc lập do Lý Nam Đế thành lập năm 544. \"Vạn Xuân\" có nghĩa là mong cho đất nước bền vững, độc lập đến muôn vạn mùa xuân.\n\n- Tổ chức: Là một nhà nước có chủ quyền hoàn chỉnh, có vua (Lý Nam Đế), có niên hiệu (Thiên Đức), có triều đình với hai ban văn võ, cho đúc tiền riêng.\n\n- Ý nghĩa: Thể hiện ý chí tự chủ, tự cường và khát vọng xây dựng một quốc gia độc lập, vững bền của dân tộc. Dù chỉ tồn tại trong thời gian ngắn (khoảng 60 năm), Vạn Xuân đã để lại một dấu ấn sâu đậm."
  },
  {
    "id": 12,
    "slug": "trieuquocdat",
    "text": "- Triệu Quốc Đạt không rõ năm sinh, ông là một huyện lệnh, hào trưởng-thủ lĩnh vùng đất thuộc Cửu Chân (Thanh Hoá), anh ruột của Triệu Thị Trinh.\n- Năm 246, ông tụ binh khởi nghĩa chống lại nhà Đông Ngô bấy giờ đang đô hộ Việt Nam.Triệu Quốc Đạt cùng nhân dân trong vùng đứng lên khởi nghĩa chống lại sự đô hộ của nhà Đông Hán.\n- Ông được coi là một trong những thủ lĩnh chủ chốt của cuộc khởi nghĩa, cùng với Bà Triệu, ông đã lãnh đạo quân khởi nghĩa đánh chiếm nhiều châu, huyện thuộc Giao Chỉ.\n- Tuy nhiên, do lực lượng còn non yếu, lại bị quân Hán phản công mạnh mẽ, cuộc khởi nghĩa sau đó bị đàn áp. Triệu Quốc Đạt đã anh dũng hy sinh trong cuộc chiến. "
  },
  {
    "id": 13,
    "slug": "chienthangbachdang938",
    "text": "- Bối cảnh: Quân Nam Hán do Lưu Hoằng Tháo chỉ huy sang xâm lược nước ta lần thứ hai với danh nghĩa giúp Kiều Công Tiễn.\n- Diễn biến: Ngô Quyền đã sử dụng kế sách độc đáo: lợi dụng thủy triều, cho đóng cọc lim bịt sắt xuống cửa sông Bạch Đằng. Khi thủy triều lên, ông cho thuyền nhẹ ra khiêu chiến, giả thua để nhử hạm đội địch vào sâu bên trong bãi cọc. Khi thủy triều rút nhanh, cọc nhọn nhô lên, thuyền địch bị đâm thủng và hỗn loạn. Quân ta từ hai bên bờ đổ ra tấn công dữ dội, tiêu diệt hoàn toàn quân Nam Hán.\n- Kết quả: Hoàng tử Nam Hán là Lưu Hoằng Tháo tử trận, vua Nam Hán phải rút quân về.\n- Ý nghĩa: Chấm dứt vĩnh viễn hơn 1000 năm Bắc thuộc, mở ra một kỷ nguyên độc lập, tự chủ lâu dài cho dân tộc Việt Nam.\n"
  },
  {
    "id": 14,
    "slug": "daicoviet",
    "text": "Lịch sử: Là quốc hiệu của Việt Nam từ thời nhà Đinh (968), qua nhà Tiền Lê, đến đầu thời nhà Lý (kết thúc năm 1054 khi vua Lý Thánh Tông đổi tên nước thành Đại Việt).\n\nKinh đô: Đặt tại Hoa Lư (Ninh Bình), một vùng đất có địa thế hiểm trở, thuận lợi cho việc phòng thủ.\n\nÝ nghĩa: \"Đại Cồ Việt\" có nghĩa là \"Nước Việt to lớn\". Quốc hiệu này thể hiện lòng tự tôn dân tộc và khát vọng về một quốc gia hùng mạnh sau khi thoát khỏi ách đô hộ."
  },
  {
    "id": 15,
    "slug": "khangchienchongtong981",
    "text": "Nguyên nhân: Nhà Tống lấy cớ nhà Đinh có biến (vua bị giết, vua mới còn nhỏ) để đem quân sang xâm lược Đại Cồ Việt.\n\nDiễn biến: Lê Hoàn đã chủ động chuẩn bị kháng chiến. Ông cho quân mai phục và giành chiến thắng quyết định ở ải Chi Lăng, tiêu diệt chủ lực quân bộ. Trên đường thủy, quân ta cũng chặn đánh quyết liệt ở sông Bạch Đằng, khiến thủy quân địch không thể phối hợp.\n\nKết quả: Cuộc kháng chiến thắng lợi hoàn toàn, nền độc lập của Đại Cồ Việt được giữ vững.\n\nÝ nghĩa: Là chiến thắng quân sự quan trọng đầu tiên của nhà nước quân chủ trung ương tập quyền, khẳng định sức mạnh và ý chí bảo vệ chủ quyền của dân tộc."
  },
  {
    "id": 16,
    "slug": "thaihauduongvannga",
    "text": "Xuất thân: Bà là vị hoàng hậu lưỡng triều của 2 triều đại ĐInh và Tiên Lê, và là mẹ ruột của vua Đinh Toàn.\n\nHành động lịch sử: Năm 979, Đinh Tiên Hoàng và con trưởng Đinh Liễn bị ám sát, Đinh Toàn mới 6 tuổi lên ngôi. Nhà Tống lợi dụng cơ hội đem quân sang xâm lược. Trước tình thế nguy nan, bà đã thay mặt triều đình, khoác áo long bào (áo của vua) lên vai Thập đạo tướng quân Lê Hoàn, trao cho ông binh quyền và suy tôn ông lên làm vua để lãnh đạo kháng chiến.\n\nÝ nghĩa: Hành động của bà thể hiện sự quyết đoán, đặt lợi ích của quốc gia, dân tộc lên trên lợi ích của dòng họ. Bà là một nhân vật then chốt trong việc chuyển giao quyền lực một cách êm đẹp từ nhà Đinh sang nhà Tiền Lê, giúp đất nước có người lãnh đạo tài ba chống giặc ngoại xâm."
  },
  {
    "id": 17,
    "slug": "lelongdinh",
    "text": " Là con thứ của Lê Hoàn, nổi tiếng là người bạo ngược, tàn ác. Sau khi Lê Hoàn mất, các hoàng tử tranh giành ngôi báu, cuối cùng Lê Long Đĩnh đã giết anh trai là Lê Long Việt để đoạt ngôi.\n\nCai trị: Ông trị vì từ năm 1005 đến 1009. Triều đại của ông được sử sách ghi lại là tàn bạo, xa xỉ, với những hình phạt man rợ, khiến lòng dân oán ghét.\n\nKết cục: Ông mất năm 1009 ở tuổi 24, có thể do bệnh tật hoặc bị đầu độc. Cái chết của ông đã chấm dứt nhà Tiền Lê.\n\nÝ nghĩa: Sự tàn bạo và mất lòng dân của Lê Long Đĩnh là nguyên nhân trực tiếp dẫn đến sự sụp đổ của nhà Tiền Lê, tạo điều kiện cho Lý Công Uẩn được triều thần tôn lên làm vua, mở ra triều đại nhà Lý."
  },
  {
    "id": 18,
    "slug": "dinhtienhoang",
    "text": "Xuất thân: Con của Đinh Công Trứ, thứ sử Hoan Châu, quê ở Hoa Lư (Ninh Bình). Lớn lên trong thời loạn lạc sau khi Ngô Quyền mất, nổi tiếng với trò chơi \"tập trận cờ lau\".\n\nSự nghiệp: Với tài năng quân sự và chính trị, ông đã lần lượt đánh bại hoặc chiêu hàng 12 sứ quân, chấm dứt tình trạng cát cứ, thống nhất đất nước vào năm 967.\n\nLập quốc: Năm 968, ông lên ngôi Hoàng đế, đặt tên nước là Đại Cồ Việt, niên hiệu là Thái Bình, định đô ở Hoa Lư.\n\nÝ nghĩa: Là người có công tái thống nhất đất nước, xây dựng một nhà nước quân chủ trung ương tập quyền đầu tiên sau thời Bắc thuộc. Việc ông xưng Đế và đặt niên hiệu đã khẳng định vị thế độc lập, ngang hàng của quốc gia Đại Cồ Việt."
  },
  {
    "id": 19,
    "slug": "vualythaito",
    "text": "Xuất thân: Làm quan đến chức Tả thân vệ Điện tiền chỉ huy sứ (chỉ huy quân cấm vệ) dưới triều Tiền Lê. Ông là người có tài, có đức, được lòng triều thần và nhân dân.\n\nLên ngôi: Sau khi vua Lê Long Đĩnh qua đời, ông được thiền sư Vạn Hạnh và các đại thần ủng hộ, tôn lên làm vua vào năm 1009, lập ra nhà Lý.\n\nDời đô về Thăng Long: Năm 1010, ông nhận thấy kinh đô Hoa Lư địa thế chật hẹp, không còn phù hợp với vai trò trung tâm của một quốc gia đang phát triển. Ông đã quyết định dời đô từ Hoa Lư ra thành Đại La và đổi tên thành Thăng Long (Rồng bay lên), với mong muốn đất nước sẽ phát triển hùng mạnh. Quyết định này được thể hiện qua bài Chiếu dời đô."
  },
  {
    "id": 20,
    "slug": "doidovethanglong",
    "text": "Sự kiện: Năm 1010, vua Lý Thái Tổ quyết định chuyển kinh đô của nước Đại Cồ Việt từ Hoa Lư (Ninh Bình) ra thành Đại La.\n\nLý do: Vua nhận thấy Đại La là vùng đất \"ở giữa khu vực trời đất\", \"rồng cuộn hổ ngồi\", đất rộng mà bằng phẳng, dân cư không khổ vì ngập lụt, là nơi trung tâm, đầu mối giao thông, thuận lợi cho việc phát triển kinh tế và quản lý đất nước lâu dài.\n\nÝ nghĩa: Mở ra một thời kỳ phát triển mới, huy hoàng cho dân tộc. Thăng Long (Hà Nội ngày nay) từ đó trở thành trung tâm chính trị, kinh tế, văn hóa của cả nước trong suốt hơn 1000 năm lịch sử."
  },
  {
    "id": 21,
    "slug": "namquocsonha",
    "text": "Bối cảnh: Ra đời trong cuộc kháng chiến chống Tống (1077) tại phòng tuyến sông Như Nguyệt.\nÝ nghĩa: Được coi là bản Tuyên ngôn độc lập đầu tiên của Việt Nam. Bài thơ đã khẳng định một cách đanh thép chủ quyền của dân tộc, là chân lý không thể chối cãi và nêu cao quyết tâm bảo vệ chủ quyền đó. Nó có tác dụng cổ vũ tinh thần quân sĩ và làm hoang mang quân giặc cực kỳ lớn."
  },
  {
    "id": 22,
    "slug": "vualythanhtong",
    "text": "Sự nghiệp: Là vị vua thứ ba của nhà Lý (trị vì 1054-1072), một trong những vị vua tài giỏi nhất triều Lý.\n\nThành tựu:\n Năm 1054, đổi tên nước từ Đại Cồ Việt thành Đại Việt. Đây là quốc hiệu tồn tại lâu dài nhất trong lịch sử.\n Năm 1070, cho lập Văn Miếu để thờ Khổng Tử và các bậc hiền triết, đánh dấu sự coi trọng Nho học.\n Cho xây dựng Quốc Tử Giám (1076, dưới thời con ông là Lý Nhân Tông) làm trường đại học đầu tiên để đào tạo nhân tài.\n Chú trọng nông nghiệp, ban hành luật bảo vệ trâu bò.\nÝ nghĩa: Đưa Đại Việt trở thành một quốc gia văn hiến, hùng mạnh về mọi mặt, từ kinh tế, quân sự đến văn hóa, giáo dục."
  },
  {
    "id": 23,
    "slug": "lythaitong",
    "text": "Sự nghiệp: Là vị vua thứ hai của nhà Lý (trị vì 1028-1054). Ông là một vị vua anh minh, có công lớn trong việc củng cố và phát triển nhà Lý.\n\nCải cách: Ban hành bộ Hình thư - bộ luật thành văn đầu tiên của Việt Nam, giúp việc xét xử công bằng hơn. Ông cũng rất nhân từ, cho giảm nhẹ nhiều hình phạt tàn khốc, đốt bỏ các dụng cụ tra tấn.\n\nĐối nội: Dẹp yên cuộc nổi loạn của Nùng Trí Cao ở biên giới phía Bắc, giữ vững biên cương.\n\nÝ nghĩa: Những cải cách của ông đã đưa nhà Lý bước vào giai đoạn phát triển ổn định, vững mạnh."
  },
  {
    "id": 24,
    "slug": "lycaotong",
    "text": "Là vị vua thứ bảy của nhà Lý (trị vì 1175-1210). Triều đại của ông đánh dấu sự suy vong toàn diện của nhà Lý.\n\nCai trị: Ông là một vị vua ăn chơi sa đọa, không quan tâm chính sự, chỉ lo xây dựng cung điện, tăng sưu cao thuế nặng để phục vụ các cuộc vui chơi của mình.\n\nHậu quả: Chính sự đổ nát, tham quan lộng hành, nhân dân đói khổ, giặc cướp nổi lên khắp nơi. Lòng dân oán hận, nhà Lý mất hết uy tín và quyền lực.\n\nÝ nghĩa: Sự cai trị tồi tệ của Lý Cao Tông là nguyên nhân trực tiếp đẩy nhà Lý đến bờ vực sụp đổ, tạo điều kiện cho thế lực họ Trần nổi lên.\n\n"
  },
  {
    "id": 25,
    "slug": "lychieuhoang",
    "text": "Xuất thân: Là con gái của vua Lý Huệ Tông, được vua cha truyền ngôi năm 1224 khi mới 6 tuổi.\n\nSự nghiệp: Bà là nữ hoàng duy nhất trong lịch sử Việt Nam. Tuy nhiên, mọi quyền hành đều nằm trong tay Điện tiền chỉ huy sứ Trần Thủ Độ.\n\nChuyển giao quyền lực: Trần Thủ Độ đã sắp xếp cho Lý Chiêu Hoàng kết hôn với cháu mình là Trần Cảnh (8 tuổi). Năm 1225, Trần Thủ Độ ép Lý Chiêu Hoàng nhường ngôi cho chồng. Trần Cảnh lên ngôi, tức vua Trần Thái Tông, nhà Trần được thành lập.\n\nÝ nghĩa: Sự kiện Lý Chiêu Hoàng nhường ngôi đã chấm dứt 216 năm tồn tại của vương triều Lý và mở ra triều đại nhà Trần một cách hòa bình, không đổ máu.\n\n"
  },
  {
    "id": 26,
    "slug": "phathoangtrannhantong",
    "text": "Sự nghiệp: Là vị vua thứ ba của nhà Trần (trị vì 1278-1293). Ông là một vị vua anh minh, một anh hùng dân tộc.\n\nKháng chiến: Ông đã trực tiếp lãnh đạo nhân dân hai lần đánh tan quân xâm lược Mông-Nguyên (1285 và 1288), một trong những đạo quân hùng mạnh nhất thế giới thời bấy giờ.\n\nSáng lập Thiền phái Trúc Lâm: Sau khi nhường ngôi cho con (vua Trần Anh Tông), ông lên núi Yên Tử (Quảng Ninh) tu hành, lấy hiệu là Trúc Lâm Đại sĩ. Ông đã thống nhất các dòng thiền trước đó để sáng lập ra Thiền phái Trúc Lâm Yên Tử, một dòng thiền mang đậm bản sắc Việt Nam.\n\nÝ nghĩa: Là một hình tượng vĩ đại trong lịch sử, vừa là một vị vua anh hùng cứu nước, vừa là một nhà tu hành đắc đạo. Ông đã thể hiện tinh thần nhập thế của Phật giáo Việt Nam: khi đất nước cần thì cầm gươm ra trận, khi hòa bình thì cởi áo cà sa tu hành."
  },
  {
    "id": 27,
    "slug": "hichtuongsi",
    "text": "Tác giả: Trần Hưng Đạo.\n\nHoàn cảnh ra đời: Viết trước cuộc kháng chiến chống Mông-Nguyên lần thứ hai (khoảng năm 1284) nhằm khích lệ tinh thần và lòng yêu nước của các binh sĩ.\n\nNội dung: Bài hịch nêu bật sự ngang ngược, tàn bạo của kẻ thù; khơi dậy lòng căm thù giặc và nỗi nhục mất nước; phân tích thiệt hơn, đúng sai để động viên tướng sĩ hết lòng đánh giặc, đồng thời thể hiện sự sẻ chia, quan tâm sâu sắc của một vị chủ soái đối với binh lính của mình.\n\nÝ nghĩa: Là một áng văn chính luận bất hủ, thể hiện lòng yêu nước nồng nàn và tư tưởng quân sự tiến bộ của Trần Hưng Đạo.\n\n"
  },
  {
    "id": 28,
    "slug": "chienthangbachdang1288",
    "text": "Là trận quyết chiến chiến lược trong cuộc kháng chiến chống Mông-Nguyên lần thứ ba. Sau khi chiếm được Thăng Long nhưng không thể tiêu diệt chủ lực của ta, quân Nguyên quyết định rút lui bằng đường thủy.\n\nDiễn biến: Dưới sự chỉ huy của Trần Hưng Đạo, quân ta đã tái hiện lại kế sách của Ngô Quyền. Cọc gỗ được đóng xuống lòng sông Bạch Đằng. Khi hạm đội của Ô Mã Nhi tiến vào, quân ta nhử địch đi qua bãi cọc lúc nước lớn. Khi thủy triều rút, cọc nhô lên, thuyền địch bị vỡ và mắc cạn. Quân ta từ mọi hướng tấn công, tiêu diệt và bắt sống toàn bộ hạm đội địch.\n\nKết quả: Bắt sống các tướng chủ chốt như Ô Mã Nhi, Phàn Tiếp. Chiến thắng này đã đập tan hoàn toàn ý chí xâm lược của nhà Nguyên.\n\nÝ nghĩa: Là một trong những trận thủy chiến vĩ đại nhất trong lịch sử thế giới. Khẳng định đỉnh cao của nghệ thuật quân sự Việt Nam và chấm dứt vĩnh viễn các cuộc xâm lược của đế chế Mông-Nguyên."
  },
  {
    "id": 29,
    "slug": "macdinhchi",
    "text": "Xuất thân: Người làng Lũng Động (Hải Dương), đỗ Trạng nguyên năm 1304 dưới thời vua Trần Anh Tông. Tương truyền ông có ngoại hình xấu xí nhưng tài năng và trí tuệ thì vô cùng xuất chúng.\n\nSự nghiệp: Là một nhà ngoại giao tài ba và một vị quan liêm khiết. Ông nhiều lần đi sứ sang nhà Nguyên, dùng tài năng, học vấn của mình để bảo vệ danh dự và lợi ích quốc gia, khiến vua Nguyên phải khâm phục và phong ông là Lưỡng quốc Trạng nguyên (Trạng nguyên của cả hai nước).\n\nÝ nghĩa: Là tấm gương sáng về tinh thần hiếu học, là biểu tượng cho tài năng, trí tuệ và phẩm giá của con người Việt Nam"
  },
  {
    "id": 30,
    "slug": "phamngulao",
    "text": "Xuất thân: Quê ở huyện Ân Thi (Hưng Yên), nổi tiếng có tài văn võ. Giai thoại kể rằng ông ngồi đan sọt giữa đường mà không hề hay biết kiệu của Hưng Đạo Vương đi qua, bị lính đâm giáo vào đùi mà không hề nhúc nhích.\n\nSự nghiệp: Được Trần Hưng Đạo gả con gái nuôi và收 làm tướng dưới trướng. Ông đã lập nhiều chiến công hiển hách trong cả hai cuộc kháng chiến chống Mông-Nguyên (1285, 1288) và trong các chiến dịch dẹp yên biên giới phía Nam.\n\nÝ nghĩa: Là một danh tướng tiêu biểu cho tinh thần \"xuất thân bình dân, phụng sự quốc gia\" thời Trần, một tấm gương về lòng dũng cảm, tài năng và lòng trung thành."
  },
  {
    "id": 31,
    "slug": "thanhnhaho",
    "text": "Vị trí: Kinh đô của nhà Hồ, đặt tại An Tôn (nay thuộc Vĩnh Lộc, Thanh Hóa).\n\nĐặc điểm: Là một tòa thành đá kiên cố, có quy mô lớn, được xây dựng rất khoa học với những phiến đá khổng lồ được đẽo gọt và lắp ghép chính xác. Đây là một công trình kiến trúc quân sự độc đáo, thể hiện sự phát triển vượt bậc về kỹ thuật xây dựng.\n\nÝ nghĩa: Là biểu tượng cho tư tưởng cải cách và sự chuẩn bị quân sự của Hồ Quý Ly. Năm 2011, Thành nhà Hồ được UNESCO công nhận là Di sản Văn hóa Thế giới."
  },
  {
    "id": 32,
    "slug": "caicachhoquyly",
    "text": "Xuất thân: Là một đại thần có quyền lực rất lớn dưới triều nhà Trần\nSự nghiệp: Trước sự suy yếu của nhà Trần cuối thế kỷ XIV, Hồ Quý Ly đã dần thâu tóm mọi quyền hành, buộc vua Trần nhường ngôi cho cháu ngoại mình là Hồ Hán Thương (con trai ông) vào năm 1400, lập ra nhà Hồ. Ông tự xưng là Thái thượng hoàng.\n\nCải cách: Ông đã thực hiện một loạt các cuộc cải cách lớn trên nhiều lĩnh vực: hạn điền (giới hạn ruộng đất), hạn nô (giới hạn nô tì), phát hành tiền giấy, cải cách giáo dục, hành chính, quân sự.\n\nKết cục: Do những cải cách tuy cấp tiến nhưng chưa phù hợp, cùng với việc cướp ngôi nhà Trần, nhà Hồ đã không tập hợp được sức mạnh toàn dân khi quân Minh sang xâm lược (1406). Nhà Hồ nhanh chóng thất bại (1407), Hồ Quý Ly bị bắt sang Trung Quốc."
  },
  {
    "id": 33,
    "slug": "leloi-vualethaito",
    "text": "Xuất thân: Là một hào trưởng có uy tín và tài sản ở Lam Sơn (Thanh Hóa), sống trong bối cảnh đất nước bị nhà Minh đô hộ.\n\nKhởi nghĩa Lam Sơn (1418-1427): Ông đã dốc hết tài sản, tập hợp anh hùng hào kiệt từ khắp nơi, dựng cờ khởi nghĩa tại Lam Sơn. Trải qua giai đoạn đầu vô cùng khó khăn, với sự giúp đỡ của các tướng sĩ tài ba như Nguyễn Trãi, Lê Lai, cuộc khởi nghĩa đã ngày càng lớn mạnh.\n\nChiến lược: Chuyển từ chiến tranh du kích ở vùng núi Thanh Hóa sang giải phóng các vùng đồng bằng, tiến quân ra Bắc, thực hiện kế sách \"vây thành diệt viện\" trong trận Chi Lăng - Xương Giang (1427), tiêu diệt hoàn toàn hai đạo quân cứu viện của nhà Minh, buộc địch ở Đông Quan phải đầu hàng.\n\nSự nghiệp: Sau khi đuổi hết quân Minh, ông lên ngôi vua năm 1428, tức vua Lê Thái Tổ, lập ra nhà Hậu Lê (Lê Sơ), đặt lại tên nước là Đại Việt."
  },
  {
    "id": 34,
    "slug": "khoinghialamson",
    "text": "Bối cảnh: Diễn ra từ 1418-1427, do Lê Lợi lãnh đạo, nhằm lật đổ ách thống trị tàn bạo của nhà Minh.\n\nDiễn biến chính: Giai đoạn đầu (1418-1423) cực kỳ gian khổ, nghĩa quân phải rút lên núi Chí Linh ba lần. Giai đoạn phát triển (1424-1426) với chiến thắng quyết định ở Tốt Động - Chúc Động, giải phóng phần lớn đất nước. Giai đoạn kết thúc (1427) với chiến thắng Chi Lăng - Xương Giang, đập tan quân cứu viện của địch.\n\nKết quả: Cuộc khởi nghĩa thắng lợi hoàn toàn, khôi phục nền độc lập dân tộc.\n\nÝ nghĩa: Là một trong những cuộc chiến tranh giải phóng dân tộc vĩ đại nhất, thể hiện sức mạnh của lòng yêu nước, tinh thần đoàn kết toàn dân và nghệ thuật quân sự tài tình."
  },
  {
    "id": 35,
    "slug": "binhngodaicao",
    "text": "Tác giả: Nguyễn Trãi, viết thay lời Lê Lợi.\n\nHoàn cảnh: Soạn thảo vào mùa đông năm 1427, sau khi quân Minh chấp nhận đầu hàng và rút về nước, để tuyên bố trước toàn dân về việc kết thúc cuộc kháng chiến và khẳng định nền độc lập.\n\nNội dung: Tác phẩm tổng kết lại toàn bộ cuộc kháng chiến: nêu cao chân lý nhân nghĩa và chủ quyền dân tộc; tố cáo tội ác tày trời của giặc Minh; tái hiện quá trình kháng chiến gian khổ mà hào hùng; và cuối cùng tuyên bố nền độc lập, hòa bình đã được lập lại.\n\nÝ nghĩa: Được coi là bản Tuyên ngôn độc lập thứ hai của Việt Nam, một áng \"thiên cổ hùng văn\" bất hủ, đỉnh cao của văn học yêu nước."
  },
  {
    "id": 36,
    "slug": "honguyentrung",
    "text": "Hồ Nguyên Trừng (1374 - 1446) là con trưởng của Hồ Quý Ly.  Ông được mệnh danh là \"Hỏa khí chi thần\", là người đã chế ra súng \"thần cơ\", loại súng có uy lực mạnh nhất thời bấy giờ. Ngoài ra ông còn chế tác ra \"Cổ Lâu Thuyền\" một loại thuyền chiến có lầu\n\nNăm 1400, Hồ Quý Ly phế truất Trần Thiếu Đế, lên ngôi vua, đặt quốc hiệu là Đại Ngu. Lẽ ra, là con trưởng, Hồ Nguyên Trừng được lập ngôi Thái tử nước Đại Ngu, nhưng sau khi thử lòng các con, biết Hồ Nguyên Trừng chỉ muốn làm quan, Hồ Quý Ly lập con thứ là Hồ Hán Thương làm Thái tử."
  },
  {
    "id": 37,
    "slug": "vualethanhtong",
    "text": "Sự nghiệp: Là vị vua thứ năm của nhà Hậu Lê (trị vì 1460-1497). Thời kỳ ông trị vì được xem là giai đoạn phát triển thịnh trị, huy hoàng nhất trong lịch sử phong kiến Việt Nam.\n\nThành tựu:\n Luật pháp: Ban hành bộ Quốc triều hình luật (thường gọi là Luật Hồng Đức), một bộ luật hoàn chỉnh, tiến bộ, có nhiều điều bảo vệ quyền lợi của người dân và phụ nữ. \n Hành chính: Cải tổ lại toàn bộ hệ thống quan lại, chia cả nước thành 13 đạo thừa tuyên để dễ quản lý.\n Quân sự: Tổ chức lại quân đội, mở mang bờ cõi về phía Nam.\n Văn hóa - Giáo dục: Rất coi trọng Nho học, mở nhiều khoa thi, lập ra hội Tao Đàn để sáng tác thơ văn.\n\nÝ nghĩa: Ông là một vị vua anh minh, một nhà cải cách lớn, đã đưa Đại Việt đạt đến đỉnh cao của sự hùng mạnh và văn hiến."
  },
  {
    "id": 38,
    "slug": "lelai",
    "text": "Xuất thân: Là một tướng lĩnh thân cận của Lê Lợi trong thời kỳ đầu của cuộc khởi nghĩa Lam Sơn.\n\nHành động: Năm 1419, khi nghĩa quân bị quân Minh vây chặt trên núi Chí Linh, tình thế vô cùng nguy cấp. Để cứu chủ tướng và cứu cuộc khởi nghĩa, Lê Lai đã đóng giả làm Lê Lợi, mặc áo ngự bào, cưỡi voi và dẫn một đội quân cảm tử lao vào vòng vây của địch.\n\nKết quả: Quân Minh tưởng đã bắt được Lê Lợi nên lơi lỏng vòng vây, nhờ đó Lê Lợi và chủ lực nghĩa quân mới có thể thoát hiểm. Lê Lai đã anh dũng hy sinh.\n\nÝ nghĩa: Hành động \"liều mình cứu chúa\" của Lê Lai là tấm gương sáng ngời về lòng trung nghĩa và sự hy sinh cao cả. Lê Lợi vô cùng thương tiếc, đã dặn lại con cháu phải làm giỗ Lê Lai trước ngày giỗ của mình.\n\n"
  },
  {
    "id": 39,
    "slug": "luongthevinh",
    "text": "Xuất thân: Quê ở Nam Định, nổi tiếng thông minh từ nhỏ, đỗ Trạng nguyên năm 1463 dưới thời vua Lê Thánh Tông.\n\nSự nghiệp: Ông là một nhà toán học, Phật học, và nhà thơ. Ông có công biên soạn cuốn Đại thành toán pháp, một công trình toán học quan trọng tổng kết các kiến thức toán học thời bấy giờ, trong đó có các phương pháp đo lường ruộng đất, tính toán thể tích...\n\nÝ nghĩa: Ông được mệnh danh là \"Trạng Lường\", là một nhà bác học lớn của Việt Nam, có nhiều đóng góp cho sự phát triển của khoa học tự nhiên thời phong kiến.\n\n"
  },
  {
    "id": 40,
    "slug": "thaihaunguyenthianh",
    "text": "Xuất thân: Là vợ của vua Lê Thái Tông, mẹ của vua Lê Nhân Tông.\n\nSự nghiệp: Sau khi vua Lê Thái Tông đột ngột qua đời, con trai bà là Lê Nhân Tông (tên thật là Lê Bang Cơ) mới 2 tuổi lên ngôi, bà trở thành Hoàng thái hậu nhiếp chính.\n\nVụ án Lệ Chi Viên: Bà bị nhiều nhà sử học nghi ngờ là người đứng sau vụ án oan Lệ Chi Viên (1442) hại chết gia đình Nguyễn Trãi. Lý do được cho là để dọn đường cho con trai mình là Bang Cơ lên ngôi một cách chắc chắn, loại bỏ người con lớn của vua là Lê Nghi Dân.\n\nKết cục: Bà bị Lê Nghi Dân giết chết trong cuộc chính biến năm 1459. Vai trò của bà trong lịch sử vẫn còn là một chủ đề gây nhiều tranh cãi.\n\n"
  },
  {
    "id": 41,
    "slug": "lebangco",
    "text": "Bối cảnh: Lê Nghi Dân là con trưởng của vua Lê Thái Tông nhưng mẹ không phải hoàng hậu nên không được lập làm thái tử. Lê Bang Cơ (tức vua Lê Nhân Tông) là con thứ nhưng do mẹ là Nguyễn Thị Anh được vua sủng ái nên được lập làm thái tử.\n\nChính biến: Bất mãn vì bị phế truất, năm 1459, Lê Nghi Dân đã cầm đầu một cuộc đảo chính, đem quân vào cung giết chết vua Lê Nhân Tông và Thái hậu Nguyễn Thị Anh, tự lập làm vua.\n\nKết cục: Lê Nghi Dân ở ngôi được 8 tháng thì bị các đại thần là Nguyễn Xí, Đinh Liệt làm binh biến lật đổ và giết chết.\n\nÝ nghĩa: Cuộc chính biến này đã phơi bày những mâu thuẫn sâu sắc trong nội bộ hoàng tộc nhà Lê, mở đầu cho giai đoạn khủng hoảng của triều đại này.\n\n"
  },
  {
    "id": 42,
    "slug": "macdangdung",
    "text": "Xuất thân: Quê ở Cổ Trai (Hải Phòng), xuất thân là một võ quan cấp thấp, nhờ có sức khỏe và tài năng mà thăng tiến nhanh chóng trong triều đình nhà Hậu Lê đang suy yếu.\n\nSự nghiệp: Lợi dụng sự hỗn loạn của triều đình, ông đã dần dần tiêu diệt các phe phái đối lập, thâu tóm toàn bộ quyền lực, trở thành người chi phối mọi việc.\n\nLập nhà Mạc: Năm 1527, ông đã ép vua Lê Cung Hoàng phải nhường ngôi, lập ra nhà Mạc.\n\nĐối ngoại: Để tránh chiến tranh với nhà Minh, ông đã thực hiện chính sách ngoại giao mềm dẻo, chấp nhận \"đầu hàng\" nhà Minh trên danh nghĩa để đổi lấy hòa bình cho đất nước. Hành động này bị các nhà sử học Nho giáo chỉ trích nặng nề.\n\n"
  },
  {
    "id": 43,
    "slug": "nguyenkim",
    "text": "Nguyễn Kim: Là một đại thần trung thành của nhà Lê. Sau khi nhà Mạc cướp ngôi, ông đã chạy sang Ai Lao (Lào), tập hợp lực lượng để khôi phục nhà Lê.\n\nÝ nghĩa: Việc Nguyễn Kim lập Lê Trang Tông làm vua đã chính thức bắt đầu thời kỳ Lê Trung Hưng. Nó tạo ra thế đối đầu Nam - Bắc triều (nhà Mạc ở phía Bắc và nhà Lê ở phía Nam, đóng tại Thanh Hóa), mở đầu cho một giai đoạn nội chiến kéo dài."
  },
  {
    "id": 44,
    "slug": "letrangtong",
    "text": "Lê Trang Tông: sau khi Nguyễn Kim tìm được Lê Duy Ninh, một hậu duệ của nhà Lê, và đưa lên ngôi vua vào năm 1533, tức vua Lê Trang Tông. Giai thoại kể rằng: Lê Trang Tông (Lê Ninh) khi còn nhỏ đã được mẹ đưa đi trốn tránh sự truy đuổi của nhà Mạc và được một trung thần là Nguyễn Kim đưa lên ngôi, lập lại nhà Lê. Trong quá trình chạy trốn, mẹ con ông gặp nhiều khó khăn, trong đó có việc vay mượn, nợ nần. Vì vậy trong dân gian, người ta ví von là \"nợ như Chúa Chổm\"\n\nÝ nghĩa: Việc Nguyễn Kim lập Lê Trang Tông làm vua đã chính thức bắt đầu thời kỳ Lê Trung Hưng. Nó tạo ra thế đối đầu Nam - Bắc triều (nhà Mạc ở phía Bắc và nhà Lê ở phía Nam, đóng tại Thanh Hóa), mở đầu cho một giai đoạn nội chiến kéo dài. "
  },
  {
    "id": 45,
    "slug": "letrunghung",
    "text": "Nhà Lê trung hưng (1533–1789) là giai đoạn sau của triều đại quân chủ nhà Hậu Lê (giai đoạn đầu là nhà Lê sơ) trong lịch sử Việt Nam. Nhà Lê trung hưng được thành lập khi Lê Trang Tông với sự phò tá của cựu thần nhà Lê sơ là Nguyễn Kim được đưa lên ngôi báu. Đây là triều đại dài nhất so với các triều đại Việt Nam với 256 năm."
  },
  {
    "id": 46,
    "slug": "nhamac",
    "text": " Do Mạc Đăng Dung thành lập, đóng đô ở Thăng Long. Triều Mạc đã có những chính sách cởi mở, phát triển kinh tế công thương nghiệp và văn hóa dân gian."
  },
  {
    "id": 47,
    "slug": "kinhdocaobang",
    "text": "Năm 1592, quân Lê - Trịnh chiếm lại được Thăng Long, nhà Mạc thất bại, phải chạy lên Cao Bằng, xây dựng nơi đây thành một khu vực cai trị riêng. Nhà Mạc ở Cao Bằng tồn tại đến năm 1677 thì bị quân Trịnh tiêu diệt hoàn toàn."
  },
  {
    "id": 48,
    "slug": "trinhtung",
    "text": "Trịnh Tùng là vị chúa đầu tiên của dòng chúa Trịnh dưới thời nhà Lê Trung hưng còn gọi là “Vua Lê chúa Trịnh”, Trịnh Tùng là cháu ruột của chúa Nguyễn đầu tiên (Nguyễn Hoàng).                                                                                                                                                                                                                                                                                                              Ông được ví là Tào Tháo của Việt Nam và đã có nhiều công lao ổn định thiên hạ."
  },
  {
    "id": 49,
    "slug": "songgianh",
    "text": "Sông Gianh: Con sông ở tỉnh Quảng Bình trở thành ranh giới tự nhiên chia cắt đất nước thành hai miền: Đàng Ngoài (từ sông Gianh trở ra Bắc) do Vua Lê - Chúa Trịnh cai quản, và Đàng Trong (từ sông Gianh trở vào Nam) do các Chúa Nguyễn cai quản."
  },
  {
    "id": 50,
    "slug": "daoduytu",
    "text": "Đào Duy Từ: Vốn là người Đàng Ngoài, rất tài giỏi nhưng không được đi thi do xuất thân là con nhà ca hát. Ông đã bỏ vào Đàng Trong theo phò Chúa Nguyễn Sãi (Nguyễn Phúc Nguyên).\n\nSự nghiệp: Ông trở thành nhà chiến lược quân sự, nhà kiến trúc hàng đầu của Chúa Nguyễn. Ông đã giúp Chúa Nguyễn xây dựng hệ thống phòng thủ kiên cố (Lũy Thầy) để chống lại quân Trịnh."
  },
  {
    "id": 51,
    "slug": "luythay",
    "text": "Lũy Thầy: Là tên gọi của một hệ thống thành lũy phòng thủ do Đào Duy Từ thiết kế và chỉ huy xây dựng ở tỉnh Quảng Bình. Hệ thống này cực kỳ kiên cố, đã giúp quân Nguyễn chặn đứng thành công nhiều cuộc tấn công quy mô lớn của quân Trịnh, góp phần tạo nên thế giằng co, chia cắt lâu dài giữa hai miền."
  },
  {
    "id": 52,
    "slug": "nguyenhoang",
    "text": "Sau khi Nguyễn Kim chết, quyền lực rơi vào tay con rể là Trịnh Kiểm. Con trai Nguyễn Kim là Nguyễn Uông bị Trịnh Kiểm giết, người con còn lại là Nguyễn Hoàng đã xin vào trấn thủ đất Thuận Hóa (từ Quảng Bình đến Thừa Thiên Huế ngày nay).\n\nSự nghiệp: ông vào phía Nam, ra sức xây dựng cơ sở, mở mang đất đai, tạo ra một thế lực riêng, tiền thân của các Chúa Nguyễn ở Đàng Trong."
  },
  {
    "id": 53,
    "slug": "trinhtrang",
    "text": "Chúa Trịnh Tráng (1577-1657) là vị chúa Trịnh thứ hai của thời Lê Trung Hưng, nắm quyền cai trị miền Bắc Việt Nam từ năm 1623 đến 1657. Ông được biết đến với việc củng cố quyền lực của họ Trịnh, đồng thời là người chứng kiến và tham gia vào các cuộc xung đột lớn giữa các thế lực trong nước. \n\nTrịnh Tráng cai trị từ năm 1623 đến 1657, đánh dấu một giai đoạn quan trọng trong lịch sử thời Lê Trung Hưng.\n\nThụy hiệu:\nÔng được vua Lê phong làm Nguyên súy thống đốc chính Thanh Đô Vương và năm 1623 và truy tặng thụy hiệu là Văn Tổ Nghị vương.\nTước vị: Trịnh Tráng là vị chúa đầu tiên chính thức xưng vương khi còn tại vị."
  },
  {
    "id": 54,
    "slug": "taysontamkiet",
    "text": "Là ba anh em ruột Nguyễn Nhạc, Nguyễn Huệ, Nguyễn Lữ, quê ở ấp Tây Sơn, huyện Phù Ly, phủ Quy Nhơn (nay thuộc Bình Định).\n\nKhởi nghĩa: Năm 1771, ba anh em phất cờ khởi nghĩa với khẩu hiệu \"lấy của người giàu chia cho người nghèo\", lật đổ ách thống trị của chúa Nguyễn ở Đàng Trong.\n\nSự nghiệp: Từ một cuộc khởi nghĩa nông dân, phong trào Tây Sơn đã phát triển thành một phong trào dân tộc quật khởi, lần lượt đánh đổ cả hai thế lực phong kiến mục nát là Chúa Nguyễn (Đàng Trong) và Chúa Trịnh (Đàng Ngoài), xóa bỏ ranh giới sông Gianh, thống nhất đất nước sau hơn 200 năm chia cắt."
  },
  {
    "id": 55,
    "slug": "nguyennhac",
    "text": "Nguyễn Nhạc: Là anh cả, người khởi xướng và là lãnh đạo ban đầu của phong trào. Sau khi lật đổ Chúa Nguyễn, ông xưng là Thái Đức Hoàng đế, cai quản vùng đất phía Nam.\n\nNăm 1771, ba anh em phất cờ khởi nghĩa với khẩu hiệu \"lấy của người giàu chia cho người nghèo\", lật đổ ách thống trị của chúa Nguyễn ở Đàng Trong.\n\nSự nghiệp: Từ một cuộc khởi nghĩa nông dân, phong trào Tây Sơn đã phát triển thành một phong trào dân tộc quật khởi, lần lượt đánh đổ cả hai thế lực phong kiến mục nát là Chúa Nguyễn (Đàng Trong) và Chúa Trịnh (Đàng Ngoài), xóa bỏ ranh giới sông Gianh, thống nhất đất nước sau hơn 200 năm chia cắt.\n\n\n"
  },
  {
    "id": 56,
    "slug": "chienthangrachgamxoaimut",
    "text": "Bối cảnh: Nguyễn Ánh (cháu của chúa Nguyễn cuối cùng) cầu cứu vua Xiêm (Thái Lan). Vua Xiêm cho 5 vạn quân thủy bộ sang xâm lược nước ta.\n\nDiễn biến: Nguyễn Huệ đã chọn khúc sông Rạch Gầm - Xoài Mút (trên sông Tiền, tỉnh Tiền Giang) làm trận địa. Ông cho quân mai phục hai bên bờ và nhử toàn bộ hạm đội địch vào trận địa. Khi thời cơ đến, quân ta từ mọi hướng đồng loạt tấn công, dùng pháo và thuyền nhỏ tiêu diệt hoàn toàn quân địch chỉ trong một ngày.\n\nÝ nghĩa: Là một trong những trận thủy chiến vĩ đại nhất lịch sử, đập tan mưu đồ xâm lược của quân Xiêm, bảo vệ vững chắc chủ quyền lãnh thổ phía Nam."
  },
  {
    "id": 57,
    "slug": "chinhsachvuaquangtrung",
    "text": "Nội dung: Sau khi thống nhất đất nước, vua Quang Trung đã ban hành hàng loạt chính sách tiến bộ nhằm phục hồi và phát triển đất nước sau chiến tranh.\n\nKinh tế: Ban hành chiếu \"Khuyến nông\" để khuyến khích sản xuất nông nghiệp.\n\nVăn hóa - Giáo dục: Đề cao chữ Nôm, đưa chữ Nôm vào thi cử, lập Viện Sùng chính để dịch sách chữ Hán ra chữ Nôm.\n\nQuốc phòng: Củng cố quân đội, xây dựng lực lượng hải quân hùng mạnh.\n\nNgoại giao: Thi hành chính sách ngoại giao vừa mềm dẻo vừa cứng rắn với nhà Thanh.\n\nKết quả: Những chính sách này bước đầu đã đem lại hiệu quả, khiến đất nước dần ổn định và phát triển. Đáng tiếc, ông đột ngột qua đời năm 1792 khi mới 39 tuổi, khiến nhiều dự định còn dang dở."
  },
  {
    "id": 58,
    "slug": "buithixuan",
    "text": "Bùi Thị Xuân: Là một nữ tướng tài ba của nhà Tây Sơn, vợ của danh tướng Trần Quang Diệu. Bà nổi tiếng với tài huấn luyện voi chiến và tài thao lược, đã cùng chồng lập nhiều chiến công.\n\nKết cục: Sau khi vua Quang Trung mất, triều đại suy yếu. Bà đã hết lòng phò tá vua Cảnh Thịnh (con của Quang Trung) chống lại Nguyễn Ánh nhưng cuối cùng thất bại và bị xử tử một cách dũng liệt.\n\nÝ nghĩa: Bà là tấm gương sáng ngời về lòng trung nghĩa và tinh thần chiến đấu bất khuất."
  },
  {
    "id": 59,
    "slug": "tranquangdieu",
    "text": "Trần Quang Diệu: Là một trong những tướng lĩnh trụ cột, trung thành và tài giỏi nhất của nhà Tây Sơn từ những ngày đầu. Ông nổi tiếng với trận bao vây và hạ thành Quy Nhơn.\n\nKết cục: Sau khi vua Quang Trung mất, triều đại suy yếu. Ông đã hết lòng phò tá vua Cảnh Thịnh (con của Quang Trung) chống lại Nguyễn Ánh nhưng cuối cùng thất bại và bị xử tử một cách dũng liệt.\n\nÝ nghĩa: Ông tấm gương sáng ngời về lòng trung nghĩa và tinh thần chiến đấu bất khuất.\n\n"
  },
  {
    "id": 60,
    "slug": "quochieuvuagialong",
    "text": "Xuất thân: Là cháu của chúa Nguyễn cuối cùng. Sau khi nhà Tây Sơn lật đổ chúa Nguyễn, ông đã phải bôn ba trốn chạy và tìm cách khôi phục cơ nghiệp.\n\nSự nghiệp: Với sự kiên trì bền bỉ và sự giúp đỡ của nhiều người (cả người Việt và người Pháp), ông đã từng bước đánh bại nhà Tây Sơn. Năm 1802, ông lật đổ hoàn toàn nhà Tây Sơn, thống nhất đất nước và lên ngôi Hoàng đế, lập ra nhà Nguyễn.\n\nQuốc hiệu: Ban đầu, ông xin nhà Thanh cho đặt quốc hiệu là Nam Việt, nhưng nhà Thanh sợ nhầm lẫn với nước Nam Việt của Triệu Đà xưa (bao gồm cả Quảng Đông, Quảng Tây của Trung Quốc), nên đã đổi lại thành Việt Nam. Năm 1804, quốc hiệu Việt Nam chính thức ra đời.\n\nÝ nghĩa: Ông là người đã thống nhất lại đất nước sau một thời gian dài nội chiến và chiến tranh. Tuy nhiên, ông cũng là người đã thực hiện chính sách trả thù tàn khốc đối với các tướng sĩ nhà Tây Sơn."
  },
  {
    "id": 61,
    "slug": "vuaminhmang",
    "text": "Sự nghiệp: Là vị vua thứ hai của nhà Nguyễn (trị vì 1820-1841), con trai của vua Gia Long. Ông là một vị vua thông minh, năng động, quyết đoán và có tinh thần tự tôn dân tộc cao.\n\nCải cách: Ông đã thực hiện một cuộc cải cách hành chính lớn và quy mô nhất thời Nguyễn, chia cả nước thành 30 tỉnh và 1 phủ (Thừa Thiên) như ngày nay. Cuộc cải cách này đã xóa bỏ sự khác biệt giữa các vùng, củng cố sự thống nhất quốc gia và tăng cường quyền lực của triều đình trung ương.\n\nĐối ngoại: Thi hành chính sách \"bế quan tỏa cảng\" (đóng cửa với phương Tây) và cấm đạo Thiên Chúa rất nghiêm ngặt.\n\n"
  },
  {
    "id": 62,
    "slug": "nguyencongtru",
    "text": "Sự nghiệp: Là một vị quan, một nhà thơ, một nhà kinh tế tài ba dưới triều Nguyễn (chủ yếu dưới thời Minh Mạng). Cuộc đời ông thăng trầm, lúc làm quan lớn, lúc bị giáng chức đi lính.\n\nCông lao: Ông có công lớn trong việc tổ chức khẩn hoang, lấn biển, lập ra các huyện Tiền Hải (Thái Bình) và Kim Sơn (Ninh Bình), tạo ra những vùng đất trù phú, giúp dân có ruộng cày cấy, ổn định cuộc sống.\n\nTư tưởng: Ông là người có chí lớn, luôn muốn sống một cuộc đời có ý nghĩa, để lại \"chút gì với núi sông\".\n\n"
  },
  {
    "id": 63,
    "slug": "caobaquat",
    "text": "Xuất thân: Quê ở Gia Lâm (Hà Nội), nổi tiếng là một nhà thơ tài hoa, chữ đẹp, có tài năng nhưng tính tình ngang tàng, phóng khoáng, không chịu luồn cúi.\n\nSự nghiệp: Ông đỗ cử nhân nhưng đi thi Hội nhiều lần bị đánh trượt do phạm quy. Ông có thái độ phê phán mạnh mẽ đối với chế độ phong kiến trì trệ. Cuối cùng, ông tham gia cuộc khởi nghĩa chống lại triều đình Tự Đức và tử trận.\n\nTác phẩm: Thơ văn của ông thể hiện một tài năng xuất chúng và một tâm hồn khao khát tự do, chống lại sự bất công. Ông được người đời mệnh danh là \"Thánh Quát\".\n\n"
  },
  {
    "id": 64,
    "slug": "levanduyet",
    "text": "Xuất thân: Là một trong những công thần khai quốc hàng đầu của nhà Nguyễn, người đã theo phò Nguyễn Ánh từ những ngày gian khổ nhất.\n\nSự nghiệp: Ông là một nhà quân sự tài ba và một nhà quản lý xuất sắc. Ông được vua Gia Long cử làm Tổng trấn Gia Định thành (cai quản toàn bộ Nam Bộ) hai lần. Trong thời gian cai quản, ông đã có công lớn trong việc giữ gìn an ninh, phát triển kinh tế, mở mang buôn bán, khiến cho vùng đất Gia Định trở nên rất trù phú, ổn định.\n\nKết cục: Do ông có chính sách cởi mở với người phương Tây, dung túng cho người theo đạo Thiên Chúa và phản đối vua Minh Mạng trong việc lập thái tử, nên sau khi ông mất, vua Minh Mạng đã cho san phẳng mộ của ông và kết tội ông."
  },
  {
    "id": 65,
    "slug": "bahuyenthanhquan",
    "text": "Tiểu sử: Tên thật là Nguyễn Thị Hinh, sống ở thế kỷ XIX, là vợ của một vị quan giữ chức tri huyện Thanh Quan (Thái Bình), nên người đời gọi bà là Bà Huyện Thanh Quan.\n\nSự nghiệp: Bà là một trong những nữ sĩ nổi tiếng nhất trong văn học trung đại Việt Nam. Thơ của bà thường mang một nỗi buồn man mác, hoài cổ, nhớ về quá khứ vàng son của triều đại nhà Lê đã qua.\n\nTác phẩm: Các tác phẩm nổi tiếng nhất của bà là \"Qua Đèo Ngang\", \"Thăng Long thành hoài cổ\". Thơ của bà có phong cách trang nhã, điêu luyện.\n\n"
  },
  {
    "id": 66,
    "slug": "khoinghiacanvuong",
    "text": "Bối cảnh: Sau sự kiện quân Pháp tấn công kinh thành Huế (1885), Tôn Thất Thuyết đã đưa vua Hàm Nghi chạy ra căn cứ Tân Sở (Quảng Trị). Tại đây, Tôn Thất Thuyết đã nhân danh vua Hàm Nghi hạ Chiếu Cần Vương, kêu gọi văn thân, sĩ phu và nhân dân cả nước đứng lên giúp vua đánh Pháp.\n\nPhong trào Cần Vương: Diễn ra sôi nổi khắp cả nước, tiêu biểu là các cuộc khởi nghĩa của Phan Đình Phùng, Nguyễn Thiện Thuật, Hoàng Hoa Thám...\n\nKết cục: Năm 1888, vua Hàm Nghi bị một tên tay sai chỉ điểm cho Pháp bắt. Ông bị đày sang Algeria và qua đời tại đó. Dù vua bị bắt, phong trào Cần Vương vẫn tiếp tục đến cuối thế kỷ XIX.\n\nÝ nghĩa: Cần Vương là một phong trào yêu nước rộng lớn, thể hiện ý chí đấu tranh giành độc lập mãnh liệt của nhân dân ta, dù dưới ngọn cờ của một ông vua trẻ tuổi."
  },
  {
    "id": 67,
    "slug": "truongdinh",
    "text": "Xuất thân: Vốn là một võ quan triều Nguyễn. Khi Pháp chiếm ba tỉnh miền Đông Nam Kỳ, triều đình ra lệnh cho ông phải bãi binh.\n\nKháng chiến: Bất tuân lệnh vua, nghe theo lời kêu gọi của nhân dân, ông đã ở lại lãnh đạo nghĩa quân chống Pháp với danh xưng Bình Tây Đại nguyên soái. Khí phách của ông được thể hiện qua câu nói: \"Triều đình chưa rõ bụng Tây, cứ một mực khăng khăng chủ hòa... làm cho lòng dân phân ly. Nếu sai Giao-hòa sứ đi điều đình, tất là trước sau phải đem cả toàn hạt Nam-kỳ nộp cho giặc.\"\n\nKết cục: Căn cứ của ông ở Gò Công bị tấn công, ông bị trọng thương và đã tự sát để bảo toàn khí tiết.\n\nÝ nghĩa: Là tấm gương tiêu biểu cho tinh thần yêu nước, chống giặc ngoại xâm của nhân dân Nam Kỳ, thể hiện ý chí \"dân muốn đánh\" đối lập với thái độ \"vua muốn hòa\" của triều đình."
  },
  {
    "id": 68,
    "slug": "vuahamnghi",
    "text": "Vua Hàm Nghi (1871-1944), tên thật là Nguyễn Phúc Ưng Lịch, là vị vua thứ 8 của triều Nguyễn, lên ngôi năm 1884 khi mới 13 tuổi. Ông được biết đến nhiều nhất qua phong trào Cần Vương, một cuộc khởi nghĩa chống Pháp do ông phát động sau khi kinh thành Huế thất thủ. Bị bắt và lưu đày sang Alger (châu Phi) năm 1888, ông sống phần đời còn lại ở đó cho đến khi qua đời năm 1944. "
  },
  {
    "id": 69,
    "slug": "nosungbandaosontra",
    "text": " Ngày 1 tháng 9 năm 1858, liên quân Pháp - Tây Ban Nha nổ súng tấn công vào bán đảo Sơn Trà, Đà Nẵng mở đầu cuộc chiến tranh xâm lược Việt Nam. Quân và dân ta dưới sự chỉ huy của Nguyễn Tri Phương, đã anh dũng chống trả, lập phòng tuyến kiên cố từ Hải Châu đến Phù Ninh, bảo vệ Đà Nẵng. \n\nMục tiêu của Pháp: Mở đầu cuộc chiến tranh xâm lược Việt Nam. Pháp chọn Đà Nẵng làm điểm tấn công đầu tiên vì đây là một hải cảng quan trọng và gần kinh đô Huế, hy vọng có thể \"đánh nhanh thắng nhanh\", buộc triều đình nhà Nguyễn đầu hàng.\n\nÝ nghĩa: Sự kiện này chính thức đánh dấu việc thực dân Pháp bắt đầu cuộc chiến tranh xâm lược Việt Nam, mở đầu cho một giai đoạn đen tối kéo dài gần một thế kỷ của dân tộc."
  },
  {
    "id": 70,
    "slug": "nguyentrungtruc",
    "text": " Ngày 1 tháng 9 năm 1858, liên quân Pháp - Tây Ban Nha nổ súng tấn công vào bán đảo Sơn Trà, Đà Nẵng.\n\nMục tiêu của Pháp: Mở đầu cuộc chiến tranh xâm lược Việt Nam. Pháp chọn Đà Nẵng làm điểm tấn công đầu tiên vì đây là một hải cảng quan trọng và gần kinh đô Huế, hy vọng có thể \"đánh nhanh thắng nhanh\", buộc triều đình nhà Nguyễn đầu hàng.\n\nÝ nghĩa: Sự kiện này chính thức đánh dấu việc thực dân Pháp bắt đầu cuộc chiến tranh xâm lược Việt Nam, mở đầu cho một giai đoạn đen tối kéo dài gần một thế kỷ của dân tộc."
  },
  {
    "id": 71,
    "slug": "hiepuochac-mang",
    "text": "Bối cảnh:\nSau khi đánh chiếm thành công thành Hà Nội lần thứ hai vào năm 1882, quân Pháp tiếp tục gây sức ép lên triều đình nhà Nguyễn, buộc triều đình phải chấp nhận sự bảo hộ của Pháp. Trong bối cảnh triều đình Huế đang bị chia rẽ, một mặt lo sợ trước sức mạnh của Pháp, mặt khác vẫn còn hy vọng vào sự giúp đỡ của nhà Thanh, Pháp đã lợi dụng tình hình này để ép triều đình ký kết Hiệp ước Harmand.\nNội dung:\nTriều đình Huế chính thức thừa nhận sự bảo hộ của Pháp ở Bắc Kỳ và Trung Kỳ.\nNam Kỳ (cụ thể là từ Bình Thuận trở vào) được xác định là thuộc địa của Pháp.\nTriều đình Huế được cai quản Trung Kỳ, nhưng mọi việc đều phải thông qua viên khâm sứ Pháp ở Huế.\nPháp nắm quyền kiểm soát các tỉnh ở Bắc Kỳ thông qua các công sứ, can thiệp vào mọi công việc của quan lại triều đình.\nTriều đình Huế phải chấp nhận sự hiện diện của quân đội Pháp trên lãnh thổ Việt Nam.\nTriều đình Huế phải chấp nhận đồng tiền do Ngân hàng Đông Dương phát hành. \nÝ nghĩa:\nHiệp ước Harmand là một bước ngoặt quan trọng, đánh dấu sự xác lập chế độ cai trị của thực dân Pháp trên toàn Việt Nam. \nHiệp ước này đã chia Việt Nam thành ba kỳ (Bắc Kỳ, Trung Kỳ, Nam Kỳ) và tạo cơ sở pháp lý cho việc cai trị lâu dài của Pháp ở Việt Nam. \nViệc ký kết Hiệp ước Harmand đã gây ra sự bất mãn sâu sắc trong nhân dân và quan lại yêu nước, thúc đẩy các phong trào kháng chiến chống Pháp diễn ra mạnh mẽ hơn. \nMặc dù triều đình Nguyễn coi việc ký kết hiệp ước như một cách để \"hoãn binh\", nhưng thực tế, hiệp ước đã mở đường cho sự thống trị hoàn toàn của Pháp trên toàn bộ Việt Nam. "
  },
  {
    "id": 72,
    "slug": "vuadongkhanh",
    "text": "Bối cảnh: Sau khi vua Hàm Nghi theo Tôn Thất Thuyết ra Tân Sở, người Pháp đã đưa Đồng Khánh (anh của Hàm Nghi) lên làm vua (1885-1889).\n\nSự nghiệp: Triều đại của Đồng Khánh hoàn toàn nằm dưới sự điều khiển của Pháp. Ông là một vị vua có thái độ hợp tác tích cực với Pháp, giúp Pháp trong việc trấn áp phong trào Cần Vương.\n\nÝ nghĩa: Ông là một vị vua bù nhìn, là công cụ để thực dân Pháp hợp pháp hóa nền cai trị của chúng ở Việt Nam."
  },
  {
    "id": 73,
    "slug": "vuathanhthai",
    "text": "Bối cảnh: Lên ngôi năm 1889 khi mới 10 tuổi. Khác với vua cha Đồng Khánh, ông là người có tư tưởng chống Pháp.\n\nHành động: Ông ngấm ngầm tìm cách liên lạc với các nhà yêu nước, học cách sử dụng vũ khí, cắt tóc ngắn... để thể hiện tinh thần dân tộc. Những hành động của ông không qua mắt được thực dân Pháp.\n\nKết cục: Lấy cớ ông bị bệnh tâm thần, năm 1907, Pháp đã ép ông phải thoái vị và đưa đi đày ở Vũng Tàu, sau đó là đảo Reunion (châu Phi)."
  },
  {
    "id": 74,
    "slug": "vuabaodai",
    "text": "Sự nghiệp: Là vị vua cuối cùng của nhà Nguyễn và của chế độ phong kiến Việt Nam (trị vì 1926-1945). Ông được đào tạo ở Pháp từ nhỏ.\n\nThoái vị: Ngày 30 tháng 8 năm 1945, trước khí thế của cuộc Cách mạng tháng Tám, ông đã đọc chiếu thoái vị tại Ngọ Môn (Huế), trao lại ấn và kiếm cho đại diện của Chính phủ lâm thời Việt Nam Dân chủ Cộng hòa. Câu nói nổi tiếng của ông trong sự kiện này là: \"Trẫm muốn được làm dân một nước tự do, hơn làm vua một nước nô lệ.\"\n\nÝ nghĩa: Hành động thoái vị của Bảo Đại đã chấm dứt hoàn toàn chế độ quân chủ tồn tại hàng ngàn năm ở Việt Nam, mở ra một trang sử mới cho dân tộc."
  },
  {
    "id": 75,
    "slug": "vuaduytan",
    "text": "Bối cảnh: Là con của vua Thành Thái, được Pháp đưa lên ngôi năm 1907 khi mới 7 tuổi, hy vọng sẽ dễ bề sai khiến.\n\nHành động: Càng lớn, vua Duy Tân càng thể hiện tinh thần yêu nước, căm ghét giặc Pháp. Ông đã bí mật liên lạc với các lãnh đạo của Việt Nam Quang phục Hội (như Thái Phiên, Trần Cao Vân) để tổ chức một cuộc khởi nghĩa lớn vào năm 1916.\n\nKết cục: Kế hoạch bị lộ, cuộc khởi nghĩa thất bại. Vua Duy Tân bị Pháp bắt và cũng bị đày sang đảo Reunion cùng vua cha Thành Thái.\n\nÝ nghĩa: Vua Thành Thái và Duy Tân là hai vị vua cuối cùng có tinh thần chống Pháp một cách rõ rệt, thể hiện khí phách của những người không chịu làm nô lệ dù đang ở trên ngai vàng."
  },
  {
    "id": 76,
    "slug": "nhanguyen",
    "text": "Nhà Nguyễn là triều đại quân chủ cuối cùng của Việt Nam do các hoàng đế họ Nguyễn thuộc dòng Nguyễn Phúc lập ra. Tổ tiên của những vị vua nhà Nguyễn là chú Nguyễn từ thời kỳ Trịnh – Nguyễn phân tranh.\n\nNguyễn Phúc Ánh chính là hoàng đế đầu tiên của dòng họ Nguyễn, ông tự xưng đế vào năm 1802. Đây cũng chính là cháu nội của chúa Nguyễn Phúc Khoát – vị chúa Nguyễn áp chót ở đàng Trong. Sau khi gia tộc Nguyễn bị quân Tây Sơn – Nguyễn Huệ lật đổ năm 1977, sau đó ông chạy trốn và bắt đầu cuộc chiến 25 năm với Tây Sơn. Nguyễn Ánh đã cầu sự viện trợ giúp của quân Pháp, quân Thanh làm cho Tây Sơn suy yếu.\n\nKhi vua Quang Trung đột ngột qua đời thì Nguyễn Ánh đã giữ vững Nam Hà và đến năm 1802 đánh bại hoàn toàn Tây Sơn  lên ngôi hoàng đế, lập nên triều đại nhà Nguyễn với tên nước Việt Nam và chọn Phú Xuân (Huế) làm kinh đô."
  },
  {
    "id": 77,
    "slug": "vanlang",
    "text": "Nhà nước Văn Lang là nhà nước đầu tiên trong lịch sử Việt Nam, ra đời vào khoảng thế kỷ VII TCN. Kinh đô của Văn Lang đặt tại Phong Châu (nay thuộc Phú Thọ). Người đứng đầu nhà nước là Hùng Vương, chia cả nước thành 15 bộ, cai quản bởi Lạc tướng. Nhà nước Văn Lang được xem là nền tảng cho sự hình thành và phát triển của nhà nước Âu Lạc sau này. \nThời gian ra đời: Khoảng thế kỷ VII TCN. \nKinh đô: Phong Châu (nay thuộc Việt Trì, Phú Thọ). \nNgười đứng đầu: Hùng Vương. \nTổ chức: Chia cả nước thành 15 bộ, do Lạc tướng cai quản. Ở cấp làng xã có Bồ chính. \nĐặc điểm:\nLà nhà nước sơ khai đầu tiên của người Việt. \nThống nhất các bộ lạc, bước đầu hình thành ý thức dân tộc. \nPhát triển kinh tế, văn hóa, xã hội (thể hiện qua di tích văn hóa Đông Sơn, truyền thuyết). \nSự kế tục: Sau khi suy yếu, nhà nước Văn Lang được thay thế bằng nhà nước Âu Lạc. \nÝ nghĩa: Đặt nền móng cho sự phát triển của nhà nước độc lập sau này. "
  },
  {
    "id": 78,
    "slug": "trieuda",
    "text": "- Thân thế: Vốn là một viên quan nhà Tần, sau cát cứ ở Lĩnh Nam và lập ra nước Nam Việt.\n- Theo Đại Việt sử ký toàn thư: Sau nhiều lần tấn công quân sự thất bại, Triệu Đà dùng kế cầu hôn công chúa Mỵ Châu cho con trai là Trọng Thủy để do thám bí mật quân sự và chia rẽ nội bộ Âu Lạc.\n- Kết quả: Năm 179 TCN, Triệu Đà bất ngờ tấn công và chiếm được Âu Lạc, mở đầu hơn một nghìn năm Bắc thuộc.\n"
  },
  {
    "id": 79,
    "slug": "trungtrac",
    "text": "Nhà Nguyễn là triều đại phong kiến cuối cùng của Việt Nam, tồn tại từ năm 1802 đến 1945, với 13 đời vua. Triều đại này được thành lập bởi Nguyễn Ánh (vua Gia Long) sau khi đánh bại nhà Tây Sơn, thống nhất đất nước và chọn Huế làm kinh đô. Triều Nguyễn chứng kiến nhiều biến động, đặc biệt là sự xâm lược của thực dân Pháp, và kết thúc khi vua Bảo Đại thoái vị vào năm 1945. \n\nThành lập:\nNguyễn Ánh (vua Gia Long) thống nhất đất nước sau khi đánh bại nhà Tây Sơn, lên ngôi năm 1802 và chọn Huế làm kinh đô. \nThống nhất và phát triển:\nTriều Nguyễn đã thống nhất đất nước sau thời kỳ nội chiến, xây dựng và phát triển nhiều mặt, đặc biệt là kinh đô Huế. \nSự xâm lược của Pháp:\nGiữa thế kỷ 19, thực dân Pháp bắt đầu xâm lược Việt Nam, gây ra nhiều khó khăn cho triều Nguyễn. Triều Nguyễn dần suy yếu do sự can thiệp của Pháp, các vua Nguyễn dần mất quyền lực thực tế. \nKết thúc triều đại:\nNăm 1945, vua Bảo Đại tuyên bố thoái vị, chấm dứt triều đại nhà Nguyễn, mở ra một kỷ nguyên mới cho Việt Nam. \nCác giai đoạn chính:\nThời kỳ đầu: Vua Gia Long, Minh Mạng, Thiệu Trị xây dựng và củng cố đất nước. \nThời kỳ suy yếu: Các vua Tự Đức, Dục Đức, Hiệp Hòa, Kiến Phúc, Hàm Nghi, Đồng Khánh, Thành Thái, Duy Tân, Khải Định, Bảo Đại đều đối mặt với sự can thiệp của Pháp. \nThời kỳ cuối: Vua Bảo Đại thoái vị, chấm dứt triều đại nhà Nguyễn. "
  },
  {
    "id": 80,
    "slug": "batrieu",
    "text": "Xuất thân: Sinh ra ở miền núi quận Cửu Chân (nay thuộc tỉnh Thanh Hóa). Bà là người có sức khỏe, võ nghệ và chí lớn.\n\nKhởi nghĩa (Năm 248): Lãnh đạo cuộc khởi nghĩa lớn chống lại ách đô hộ của nhà Đông Ngô. Câu nói nổi tiếng của bà: \"Tôi muốn cưỡi cơn gió mạnh, đạp luồng sóng dữ, chém cá kình ở biển Đông, giành lại giang sơn, cởi ách nô lệ, chứ không chịu khom lưng làm tì thiếp cho người.\"\n\nKết cục: Cuộc khởi nghĩa làm chấn động Giao Châu nhưng cuối cùng bị quân Ngô đàn áp khốc liệt. Bà Triệu đã anh dũng hy sinh trên núi Tùng (Thanh Hóa).\n\nÝ nghĩa: Tiếp nối tinh thần bất khuất của Hai Bà Trưng, khẳng định sức sống mãnh liệt và khát vọng độc lập không ngừng của dân tộc."
  },
  {
    "id": 81,
    "slug": "lybi",
    "text": "Xuất thân: Một hào trưởng có tài ở địa phương, từng làm quan cho nhà Lương nhưng sau đó từ quan về quê tập hợp lực lượng.\n\nKhởi nghĩa (Năm 542): Lãnh đạo cuộc khởi nghĩa lật đổ ách đô hộ của nhà Lương.\n\nSự nghiệp: Năm 544, Lý Bí tự xưng là Lý Nam Đế, đặt tên nước là Vạn Xuân, niên hiệu là Thiên Đức. Ông cho xây dựng nhà nước với triều đình riêng, khẳng định vị thế độc lập ngang hàng với phương Bắc.\n\nKết cục: Năm 545, nhà Lương cử quân sang xâm lược. Lý Nam Đế thua trận, phải rút về động Khuất Lão và qua đời tại đây (548)."
  },
  {
    "id": 82,
    "slug": "maithucloan-maihacde",
    "text": "Xuất thân: Ông quê ở Mai Phụ (Hà Tĩnh), phải đi phu gánh vải cống nạp cho nhà Đường.\n\nKhởi nghĩa (Đầu thế kỷ VIII, khoảng năm 713-722): Ông đã kêu gọi những người dân phu khởi nghĩa chống lại ách đô hộ của nhà Đường. Cuộc khởi nghĩa lan rộng khắp Giao Châu, ông xây dựng căn cứ ở Sa Nam (Nghệ An) và xưng là Mai Hắc Đế (Vua Đen họ Mai).\n\nKết cục: Nhà Đường huy động một đạo quân lớn sang đàn áp, cuộc khởi nghĩa thất bại.\n\nÝ nghĩa: Là một trong những cuộc đấu tranh vũ trang lớn, thể hiện tinh thần quật cường của nhân dân, làm lung lay nền thống trị của nhà Đường."
  },
  {
    "id": 83,
    "slug": "phunghung",
    "text": "Xuất thân: Là một hào trưởng có uy tín ở Đường Lâm (Sơn Tây, Hà Nội), nổi tiếng là người có sức khỏe phi thường.\n\nKhởi nghĩa (Cuối thế kỷ VIII, khoảng năm 776-791): Ông lãnh đạo cuộc khởi nghĩa chống lại ách đô hộ của nhà Đường, bao vây và chiếm được phủ thành Tống Bình (Hà Nội).\n\nKết quả: Ông giành được quyền tự chủ trong một thời gian. Sau khi ông mất, nhân dân tôn ông là Bố Cái Đại Vương (nghĩa là \"Vua cha mẹ\"). Con trai ông là Phùng An nối nghiệp nhưng sau đó đã đầu hàng quân Đường.\n\nÝ nghĩa: Tiếp nối truyền thống đấu tranh giành độc lập, thể hiện sự ủng hộ của nhân dân đối với các thủ lĩnh yêu nước."
  },
  {
    "id": 84,
    "slug": "khucthuadu",
    "text": "Là một hào trưởng ở Hồng Châu (Hải Dương). Cuối thế kỷ IX, nhà Đường suy yếu trầm trọng do các cuộc khởi nghĩa nông dân.\n\nSự nghiệp: Tận dụng thời cơ, năm 905, Khúc Thừa Dụ đã tiến quân ra chiếm thành Đại La (Hà Nội), tự xưng là Tiết độ sứ, thiết lập chính quyền tự chủ. Ông cai trị một cách khôn khéo, \"bình thường như cũ\" để nhà Đường phải công nhận.\n\nÝ nghĩa: Mở ra thời kỳ tự chủ cho dân tộc một cách hòa bình. Hành động của ông đã đặt nền tảng vững chắc cho công cuộc giành độc lập hoàn toàn sau này của Ngô Quyền."
  },
  {
    "id": 85,
    "slug": "ngoquyen",
    "text": "Ông là con rể của Dương Đình Nghệ (người kế tục họ Khúc nắm quyền tự chủ), một tướng tài quê ở Đường Lâm (Sơn Tây, Hà Nội).\n\nSự nghiệp: Năm 937, Kiều Công Tiễn giết Dương Đình Nghệ để đoạt chức. Ngô Quyền lập tức đem quân ra Bắc tiêu diệt Kiều Công Tiễn để trả thù.\n\nChiến thắng Bạch Đằng: Biết Kiều Công Tiễn đã cầu cứu quân Nam Hán, Ngô Quyền đã chủ động đón đánh giặc. Ông cho đóng cọc gỗ bịt sắt nhọn xuống lòng sông Bạch Đằng. Năm 938, ông nhử thuyền giặc vào bãi cọc lúc thủy triều lên và tổ chức phản công quyết liệt khi thủy triều rút, tiêu diệt hoàn toàn quân xâm lược."
  },
  {
    "id": 86,
    "slug": "lehoan-ledaihanh",
    "text": "Sự nghiệp: Là Thập đạo tướng quân (Tổng chỉ huy quân đội) dưới triều nhà Đinh. Năm 980, ông được Thái hậu Dương Vân Nga và triều thần suy tôn lên ngôi vua để tổ chức kháng chiến chống Tống, lập ra nhà Tiền Lê.\n\nKháng chiến chống Tống (981): Ông đã trực tiếp chỉ huy quân đội, cho đóng cọc ở sông Bạch Đằng để chặn đường tiến của thủy quân Tống, đồng thời bố trí phục kích, đánh tan quân bộ của giặc ở Chi Lăng (Lạng Sơn), buộc nhà Tống phải từ bỏ mộng xâm lược.\n\nĐối nội: Sau chiến tranh, ông chú trọng phát triển kinh tế nông nghiệp, cho đào sông, xây dựng đường sá, củng cố nền độc lập.\n\nÝ nghĩa: Là một vị anh hùng dân tộc, một nhà quân sự tài ba đã bảo vệ thành công nền độc lập non trẻ của đất nước trước kẻ thù xâm lược hùng mạnh."
  },
  {
    "id": 87,
    "slug": "lynhantong",
    "text": "Xuất thân: Tên thật là Lý Càn Đức. Con vua Lý Thánh Tông, được lập làm thái tử ngay khi mới sinh\n\nSự nghiệp: Lên ngôi lúc 6 tuổi và đến khi mất là 62 tuổi. Thời gian trị vì lâu nhất lịch sử Việt Nam, tức 56 năm.\n\nCông lao:\n- Năm 1075, tổ chức khoa thi Minh Kinh Bác Học - kì thi đầu tiên trong lịch sử Việt Nam để tuyển quan văn.\n- Năm 1076, xây Quốc Tử Giám tại Thăng Long - Trường đại học đầu tiên"
  },
  {
    "id": 88,
    "slug": "lythuongkiet",
    "text": "Xuất thân: Vốn là một hoạn quan, nhưng là một nhà quân sự, chính trị kiệt xuất thời nhà Lý, phục vụ qua ba triều vua (Thái Tông, Thánh Tông, Nhân Tông).\n\nSự nghiệp quân sự:\n\nTiên phát chế nhân (Chủ động tấn công trước): Năm 1075, nhận thấy nhà Tống đang ráo riết chuẩn bị xâm lược, ông đã chủ động dẫn quân đánh sang đất Tống, phá hủy các căn cứ quân sự, lương thực của địch tại Ung Châu, Khâm Châu, Liêm Châu.\n\nPhòng thủ: Sau khi rút quân về, ông cho xây dựng phòng tuyến sông Như Nguyệt (sông Cầu, Bắc Ninh) để chặn giặc.\n\nNam quốc sơn hà: Trong trận chiến tại phòng tuyến Như Nguyệt, để khích lệ tinh thần quân sĩ, ông đã cho người ngâm bài thơ \"Nam quốc sơn hà\" trong đền thờ ven sông."
  },
  {
    "id": 89,
    "slug": "tranthaitong",
    "text": "Sự nghiệp: Là vị vua đầu tiên của nhà Trần (trị vì 1225-1258). Ông lên ngôi khi còn rất nhỏ, việc triều chính do Thái sư Trần Thủ Độ điều hành.\n\nCông lao: Cùng với Trần Thủ Độ, ông đã củng cố lại chính quyền trung ương, xây dựng quân đội vững mạnh, phát triển kinh tế, ổn định xã hội sau thời kỳ suy vong của nhà Lý.\n\nKháng chiến chống Mông-Nguyên: Năm 1258, ông đã trực tiếp lãnh đạo cuộc kháng chiến chống quân Mông Cổ xâm lược lần thứ nhất và giành thắng lợi vẻ vang, bảo vệ được nền độc lập.\n\nTư tưởng: Cuối đời, ông nhường ngôi cho con và lên làm Thái thượng hoàng, chuyên tâm nghiên cứu Phật học và để lại nhiều tác phẩm có giá trị."
  },
  {
    "id": 90,
    "slug": "trannhantong",
    "text": "Sự nghiệp: Là vị vua thứ ba của nhà Trần (trị vì 1278-1293). Ông là một vị vua anh minh, một anh hùng dân tộc.\n\nKháng chiến: Ông đã trực tiếp lãnh đạo nhân dân hai lần đánh tan quân xâm lược Mông-Nguyên (1285 và 1288), một trong những đạo quân hùng mạnh nhất thế giới thời bấy giờ.\n\nSáng lập Thiền phái Trúc Lâm: Sau khi nhường ngôi cho con (vua Trần Anh Tông), ông lên núi Yên Tử (Quảng Ninh) tu hành, lấy hiệu là Trúc Lâm Đại sĩ. Ông đã thống nhất các dòng thiền trước đó để sáng lập ra Thiền phái Trúc Lâm Yên Tử, một dòng thiền mang đậm bản sắc Việt Nam.\n\nÝ nghĩa: Là một hình tượng vĩ đại trong lịch sử, vừa là một vị vua anh hùng cứu nước, vừa là một nhà tu hành đắc đạo. Ông đã thể hiện tinh thần nhập thế của Phật giáo Việt Nam: khi đất nước cần thì cầm gươm ra trận, khi hòa bình thì cởi áo cà sa tu hành."
  },
  {
    "id": 91,
    "slug": "tranhungdao",
    "text": "Xuất thân: Là một tôn thất nhà Trần, cháu của Trần Thủ Độ, được phong tước Hưng Đạo Vương. Ông là một nhà chính trị, nhà quân sự kiệt xuất nhất trong lịch sử Việt Nam.\n\nSự nghiệp: Ông được vua Trần Nhân Tông giao làm Quốc công tiết chế, thống lĩnh toàn bộ quân đội trong hai cuộc kháng chiến chống Mông-Nguyên lần thứ hai (1285) và lần thứ ba (1288).\n\nTư tưởng: Ông chủ trương \"khoan thư sức dân\" để làm kế sâu rễ bền gốc, lấy dân làm gốc cho công cuộc giữ nước. Ông cũng là tác giả của các bộ binh thư nổi tiếng như Binh thư yếu lược, Vạn Kiếp tông bí truyền thư và đặc biệt là bài Hịch tướng sĩ.\n\nÝ nghĩa: Là linh hồn của các cuộc kháng chiến chống Mông-Nguyên, một thiên tài quân sự với tài năng và đức độ vẹn toàn, được nhân dân tôn thờ như một vị Thánh (Đức Thánh Trần)."
  },
  {
    "id": 92,
    "slug": "hoquyly",
    "text": "Xuất thân: Là một đại thần có quyền lực rất lớn dưới triều nhà Trần, ông có 2 người cô đều là phi tần nhà Trần.\n\nSự nghiệp: Tận dụng sự suy yếu của nhà Trần cuối thế kỷ XIV, Hồ Quý Ly đã dần thâu tóm mọi quyền hành, buộc vua Trần nhường ngôi cho cháu ngoại mình là Hồ Hán Thương (con trai ông) vào năm 1400, lập ra nhà Hồ. Ông tự xưng là Thái thượng hoàng.\n\nCải cách: Ông đã thực hiện một loạt các cuộc cải cách lớn trên nhiều lĩnh vực: hạn điền (giới hạn ruộng đất), hạn nô (giới hạn nô tì), phát hành tiền giấy, cải cách giáo dục, hành chính, quân sự.\n\nKết cục: Do những cải cách cấp tiến, động chạm đến quyền lợi của tầng lớp quý tộc Trần và chưa được lòng dân, cùng với việc cướp ngôi nhà Trần, nhà Hồ đã không tập hợp được sức mạnh toàn dân khi quân Minh sang xâm lược (1406). Nhà Hồ nhanh chóng thất bại (1407), Hồ Quý Ly bị bắt sang Trung Quốc."
  },
  {
    "id": 93,
    "slug": "trinhnguyenphantranh",
    "text": "Bối cảnh: Sau khi Nguyễn Kim chết, quyền lực rơi vào tay con rể là Trịnh Kiểm. Con trai Nguyễn Kim là Nguyễn Uông bị Trịnh Kiểm giết, người con còn lại là Nguyễn Hoàng lo sợ đã xin vào trấn thủ đất Thuận Hóa (từ Quảng Bình đến Thừa Thiên Huế ngày nay).\n\nNguyễn Hoàng: Vào phía Nam, Nguyễn Hoàng đã ra sức xây dựng cơ sở, mở mang đất đai, tạo ra một thế lực riêng, tiền thân của các Chúa Nguyễn ở Đàng Trong.\n\nTrịnh Tùng: Con của Trịnh Kiểm, là người đã chính thức tiêu diệt nhà Mạc ở Thăng Long, củng cố quyền lực của các Chúa Trịnh ở Đàng Ngoài.\n\nTrịnh-Nguyễn phân tranh: Mâu thuẫn giữa hai họ Trịnh - Nguyễn ngày càng gay gắt, dẫn đến cuộc chiến tranh kéo dài gần 50 năm (1627-1672).\n\nSông Gianh: Con sông ở tỉnh Quảng Bình trở thành ranh giới tự nhiên chia cắt đất nước thành hai miền: Đàng Ngoài (từ sông Gianh trở ra Bắc) do Vua Lê - Chúa Trịnh cai quản, và Đàng Trong (từ sông Gianh trở vào Nam) do các Chúa Nguyễn cai quản."
  },
  {
    "id": 94,
    "slug": "quangtrungnguyenhue",
    "text": "Quang Trung, tên thật là Nguyễn Huệ, là một nhà quân sự và chính trị kiệt xuất của Việt Nam, và là một trong ba anh em nhà Tây Sơn (Tây Sơn tam kiệt). \nNguyễn Huệ sinh năm 1753 tại vùng Tây Sơn, phủ Quy Nhơn (nay là huyện Tây Sơn, tỉnh Bình Định). Ông người gốc họ Hồ, thuở nhỏ tên là Thơm, sau đổi tên thành Nguyễn Huệ, sinh ra trong gia đình có 03 anh em\nÔng là linh hồn của các chiến thắng quân sự vang dội như:\n\nChiến thắng Rạch Gầm - Xoài Mút (1785): Đánh tan 5 vạn quân Xiêm xâm lược.\n\nTiến quân ra Bắc (1786): Lật đổ chính quyền Chúa Trịnh.\n\nĐại phá quân Thanh (1789): Đánh tan 29 vạn quân Mãn Thanh xâm lược, giải phóng Thăng Long.\n\nLên ngôi: Cuối năm 1788, để chính danh hiệu triệu, tập hợp lòng người chống quân Thanh, Nguyễn Huệ lên ngôi Hoàng đế tại Phú Xuân (Huế), lấy niên hiệu là Quang Trung. Sau chiến thắng, ông bắt tay vào xây dựng đất nước với nhiều chính sách tiến bộ. Tuy nhiên không lâu sau đó, Ngài qua đời với rất nhiều dự định còn đang dang dở, để lại nhiều tiếc nuổi cho hậu thế mai sau."
  },
  {
    "id": 95,
    "slug": "nguyentriphuong",
    "text": "Sự nghiệp: Là một danh tướng, một vị Tổng chỉ huy quân đội triều Nguyễn. Ông là người đã trực tiếp chỉ huy quân đội chống Pháp ở cả ba mặt trận quan trọng nhất:\n\nĐà Nẵng (1858): Cùng quân dân xây dựng phòng tuyến, cầm chân quân Pháp trong một thời gian dài.\n\nGia Định (1861): Được cử vào Nam giữ thành Gia Định.\n\nHà Nội (1873): Được cử ra Bắc giữ thành Hà Nội.\n\nKết cục: Khi thành Hà Nội thất thủ lần thứ nhất, ông bị trọng thương. Ông đã tuyệt thực để tuẫn tiết, thể hiện khí phách của một vị tướng trung quân ái quốc."
  },
  {
    "id": 96,
    "slug": "vuatuduc",
    "text": "Sự nghiệp: Là vị vua thứ tư của nhà Nguyễn, trị vì lâu nhất (1847-1883). Ông là người hay chữ, yêu thơ văn nhưng lại cai trị đất nước trong bối cảnh vô cùng khó khăn.\n\nThái độ với Pháp: Khi thực dân Pháp bắt đầu xâm lược, triều đình Tự Đức đã tỏ ra bạc nhược, thiếu quyết đoán. Đường lối chủ đạo là \"chủ hòa\", muốn thương lượng, nhân nhượng để giữ lại ngai vàng, bỏ lỡ nhiều cơ hội phản công.\n\nHậu quả: Chính sách sai lầm của triều đình đã khiến Việt Nam từng bước rơi vào tay Pháp, mà đỉnh điểm là việc ký các hiệp ước bất bình đẳng, thừa nhận sự bảo hộ của Pháp. Ông trị vì cho đến khi mất nước."
  },
  {
    "id": 97,
    "slug": "vuahiephoa",
    "text": "Bối cảnh: Là em của vua Tự Đức. Sau khi vua Tự Đức mất, quyền thần Tôn Thất Thuyết và Nguyễn Văn Tường phế bỏ vua Dục Đức, đưa ông lên ngôi (1883).\n\nCai trị: Ông lên ngôi đúng lúc quân Pháp đang tấn công vào Thuận An (cửa ngõ kinh thành Huế). Trước sức ép của Pháp, ông đã tự ý ký kết Hiệp ước Harmand (Quý Mùi), một hiệp ước đầu hàng, thừa nhận sự bảo hộ hoàn toàn của Pháp lên toàn cõi Việt Nam.\n\nKết cục: Hành động đầu hàng của ông đã khiến phe chủ chiến do Tôn Thất Thuyết đứng đầu vô cùng tức giận. Ông bị ép phải uống thuốc độc tự tử sau khi ở ngôi được 4 tháng."
  }
]